{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 2187, 1], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv1D", "name": "conv1d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_1", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_1", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_1", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_2", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_2", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_2", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_3", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_3", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_3", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_4", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_4", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_4", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_5", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_5", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_5", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_6", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_6", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_6", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "kernel_size": [3], "strides": [1], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "conv1d_7", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_7", "config": {"dtype": "float32", "padding": "same", "strides": [3], "name": "max_pooling1d_7", "trainable": true, "data_format": "channels_last", "pool_size": [3]}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 50, "activation": "relu", "dtype": "float32", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["max_pooling1d_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 12, "activation": "softmax", "dtype": "float32", "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "keras_version": "2.3.1"}