{"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 6561, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 32, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [3], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_1"}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_1", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_1"}, {"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 32, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [1], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_2"}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "dtype": "float32"}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_2", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_2"}, {"inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 64, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [1], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_3"}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null, "dtype": "float32"}, "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_3", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_3"}, {"inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 64, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [1], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_4"}, {"inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_4", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_4"}, {"inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 128, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [1], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_5"}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_5", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_5"}, {"inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 128, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [1], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_6"}, {"inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_6", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_6"}, {"inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"filters": 256, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "conv1d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1], "dtype": "float32", "kernel_size": [3], "use_bias": true, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "strides": [1], "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}, "name": "conv1d_7"}, {"inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling1d_7", "padding": "same", "strides": [3], "dtype": "float32", "pool_size": [3]}, "name": "max_pooling1d_7"}, {"inbound_nodes": [[["max_pooling1d_7", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "units": 50, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "activation": "relu", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "units": 3, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "activation": "softmax", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "keras_version": "2.3.1", "backend": "tensorflow"}