{"config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 6561, 1]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"bias_constraint": null, "filters": 16, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_1", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [3], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_1"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_1", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_1"}, {"config": {"bias_constraint": null, "filters": 16, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_2", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_2"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_2", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_2"}, {"config": {"bias_constraint": null, "filters": 32, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_3", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_3"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_3", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_3"}, {"config": {"bias_constraint": null, "filters": 32, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_4", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_4"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_4", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_4"}, {"config": {"bias_constraint": null, "filters": 16, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_5", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_5"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_5", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_5"}, {"config": {"bias_constraint": null, "filters": 16, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_6", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_6"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_6", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_6"}, {"config": {"bias_constraint": null, "filters": 16, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv1d_7", "padding": "same", "kernel_size": [3], "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_7"}, {"config": {"pool_size": [3], "trainable": true, "dtype": "float32", "strides": [3], "name": "max_pooling1d_7", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_7"}, {"config": {"bias_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["max_pooling1d_7", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"bias_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2"}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.3.1", "class_name": "Model", "backend": "tensorflow"}